Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/importing_car_into_ireland.html.txt.tmx
Source language: en
Languages: ga

source: At the inspection the vehicle will be examined to ensure its characteristics match those recorded in the registration documentation
ga: Ag an gcigireacht seo, déanfar scrúdú ar an bhfeithicil lena chinntiú gurb ionann a saintréithe agus iad siúd atá curtha i dtaifead sa cháipéisíocht chláraithe

source: The details will be used by Revenue to assess the amount of VRT payable, based on the value of the car
ga: Úsáidfidh na Coimisinéirí Ioncaim na sonraí chun measúnú a dhéanamh ar an méid CCF atá iníoctha, bunaithe ar luach an chairr

source: You pay the VRT charged to the NCTS
ga: Íocann tusa an CCF a ghearrtar ar an STNC

source: The registration process must be completed within 30 days of the vehicle's arrival in Ireland
ga: Ní mór an próiseas cláraithe a chríochnú laistigh de 30 lá tar éis go dtagann an fheithicil go hÉirinn

source: Once the vehicle has been registered and the VRT paid, you will receive:
ga: Chomh luath agus atá an fheithicil cláraithe agus an CCF íoctha, gheobhaidh tú (nó do dhéileálaí carranna:

source: • A receipt for the VRT paid showing the registration number assigned to your car
ga: • Admháil don CCF íoctha a léiríonn an uimhir chláraithe atá sannta do do charr

source: • A Form RF100 for use when you are applying to pay motor tax
ga: • Foirm RF RF100 atá le húsáid nuair atá iarratas á dhéanamh ar mhótarcháin a íoc

source: To pay motor tax, you will need to insure the car and have your insurance details
ga: Chun mótarcháin a íoc, beidh ort árachas a íoc ar an gcarr agus do chuid sonraí árachais a bheith agat

source: You can pay motor tax online at motortax.ie or at the Motor Taxation Office of your local authority
ga: Is féidir leat mótarcháin a íoc ar líne ag motortax.ie nó ag Oifig Mhótarchánach d’údaráis áitiúil

source: After you have paid the motor tax, the Vehicle Registration Certificate will be issued to you by the Department of Transport, Tourism and Sport
ga: Tar éis go n-íocann tú an mhótarcháin, eiseoidh an Roinn Iompair, Turasóireachta agus Spóirt do Dheimhniú Clárúcháin Feithicle duit

source: If the car is 4 years old or more it must also undergo the National Car Test immediately – see ‘National Car Test’ above
ga: Má tá an carr 4 bliana d’aois nó níos mó, ní mór Tástáil Náisiúnta Carranna a dhéanamh air láithreach – féach ‘An Tástáil Náisiúnta Carranna’ thuas

source: There is detailed information about the registration process on the NCTS website
ga: Tá faisnéis mhionsonraithe ar fáil faoin bpróiseas clárúcháin ar láithreán gréasáin an STNC
